{
  "_name_or_path": "google/gemma-4-12B-it-qat-q4_0-gguf",
  "model_type": "gemma4_unified",
  "architectures": ["Gemma4ForMultimodalLM"],
  "processor_class": "Gemma4Processor",
  "torch_dtype": "bfloat16",
  "quantization_config": {
    "family": "gemma4_qat",
    "format": "q4_0",
    "container": "gguf",
    "loader_scope": "metadata_only_pending_q4_0_weight_loader"
  },
  "text_config": {
    "model_type": "gemma4_text",
    "architectures": ["Gemma4ForCausalLM"],
    "hidden_size": 5120,
    "num_hidden_layers": 48,
    "num_attention_heads": 32,
    "num_key_value_heads": 16,
    "intermediate_size": 20480,
    "hidden_activation": "gelu_pytorch_tanh"
  }
}
