{
  "model_type": "falcon",
  "architectures": ["FalconForCausalLM"],
  "hidden_size": 4544,
  "num_hidden_layers": 32,
  "num_attention_heads": 71,
  "num_kv_heads": 1,
  "vocab_size": 65024,
  "torch_dtype": "bfloat16"
}
