{
  "_name_or_path": "google/gemma-4-E2B-it-qat-mobile-transformers",
  "model_type": "gemma4_unified",
  "architectures": ["Gemma4ForMultimodalLM"],
  "processor_class": "Gemma4Processor",
  "torch_dtype": "bfloat16",
  "quantization_config": {
    "family": "gemma4_qat",
    "format": "mobile",
    "container": "transformers",
    "activation_scaling": "static",
    "channel_wise": true,
    "token_generation_bits": 2,
    "loader_scope": "metadata_only_pending_mobile_quant_loader"
  },
  "text_config": {
    "model_type": "gemma4_text",
    "architectures": ["Gemma4ForCausalLM"],
    "hidden_activation": "gelu_pytorch_tanh"
  }
}
