{
  "model_type": "gemma",
  "architectures": ["GemmaForCausalLM"],
  "hidden_size": 3072,
  "num_hidden_layers": 28,
  "num_attention_heads": 16,
  "num_key_value_heads": 16,
  "intermediate_size": 24576,
  "vocab_size": 256000,
  "torch_dtype": "bfloat16"
}
