{
  "_name_or_path": "Phi-4-mini-instruct",
  "model_type": "phi3",
  "architectures": ["Phi3ForCausalLM"],
  "hidden_size": 3072,
  "num_hidden_layers": 32,
  "num_attention_heads": 24,
  "num_key_value_heads": 8,
  "intermediate_size": 8192,
  "vocab_size": 200064,
  "partial_rotary_factor": 0.75,
  "max_position_embeddings": 131072,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16"
}
