{
  "model_type": "phi3",
  "architectures": ["Phi3ForCausalLM"],
  "hidden_size": 3072,
  "num_hidden_layers": 32,
  "num_attention_heads": 32,
  "num_key_value_heads": 32,
  "intermediate_size": 8192,
  "vocab_size": 32064,
  "torch_dtype": "bfloat16"
}
