{
  "model_type": "gemma3_text",
  "architectures": ["Gemma3ForCausalLM"],
  "hidden_size": 4096,
  "num_hidden_layers": 34,
  "num_attention_heads": 16,
  "num_key_value_heads": 8,
  "intermediate_size": 16384,
  "vocab_size": 256000,
  "layer_types": ["full_attention", "sliding_attention"],
  "hidden_activation": "gelu_pytorch_tanh",
  "torch_dtype": "bfloat16"
}
