{
  "model_type": "cohere2",
  "architectures": ["Cohere2ForCausalLM"],
  "hidden_size": 4096,
  "num_hidden_layers": 32,
  "num_attention_heads": 32,
  "num_key_value_heads": 8,
  "intermediate_size": 14336,
  "vocab_size": 256000,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16"
}
