{
  "model_type": "mistral",
  "architectures": ["MistralForCausalLM"],
  "hidden_size": 4096,
  "num_hidden_layers": 32,
  "num_attention_heads": 32,
  "num_key_value_heads": 8,
  "intermediate_size": 14336,
  "vocab_size": 32000,
  "sliding_window": 4096,
  "torch_dtype": "bfloat16"
}
