{
  "model_type": "gemma2",
  "architectures": ["Gemma2ForCausalLM"],
  "hidden_size": 3584,
  "num_hidden_layers": 42,
  "num_attention_heads": 16,
  "num_key_value_heads": 8,
  "intermediate_size": 14336,
  "vocab_size": 256000,
  "attn_logit_softcapping": 50.0,
  "final_logit_softcapping": 30.0,
  "torch_dtype": "bfloat16"
}
