{
  "_name_or_path": "google/gemma-4-12B-it",
  "model_type": "gemma4_unified",
  "architectures": ["Gemma4UnifiedForConditionalGeneration"],
  "processor_class": "Gemma4Processor",
  "torch_dtype": "bfloat16",
  "image_token_id": 258880,
  "audio_token_id": 258881,
  "video_token_id": 258884,
  "text_config": {
    "model_type": "gemma4_unified_text",
    "architectures": ["Gemma4ForCausalLM"],
    "hidden_size": 3840,
    "num_hidden_layers": 48,
    "num_attention_heads": 16,
    "num_key_value_heads": 8,
    "num_global_key_value_heads": 1,
    "head_dim": 256,
    "global_head_dim": 512,
    "attention_k_eq_v": true,
    "intermediate_size": 15360,
    "vocab_size": 262144,
    "vocab_size_per_layer_input": 262144,
    "max_position_embeddings": 131072,
    "sliding_window": 1024,
    "layer_types": [
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention"
    ],
    "hidden_activation": "gelu_pytorch_tanh",
    "tie_word_embeddings": true
  },
  "vision_config": {
    "model_type": "gemma4_unified_vision",
    "architectures": ["Gemma4VisionModel"],
    "mm_embed_dim": 3840,
    "output_proj_dims": 3840
  },
  "audio_config": {
    "model_type": "gemma4_unified_audio",
    "architectures": ["Gemma4AudioModel"],
    "hidden_size": 640,
    "output_proj_dims": 640
  },
  "tie_word_embeddings": true
}
