{
  "model_type": "code_llama",
  "architectures": ["LlamaForCausalLM"],
  "hidden_size": 4096,
  "num_hidden_layers": 32,
  "num_attention_heads": 32,
  "num_key_value_heads": 32,
  "intermediate_size": 11008,
  "vocab_size": 32016,
  "rope_theta": 1000000.0,
  "torch_dtype": "float16"
}
