{
  "model_type": "bert",
  "architectures": ["BertForMaskedLM"],
  "hidden_size": 768,
  "num_hidden_layers": 12,
  "num_attention_heads": 12,
  "intermediate_size": 3072,
  "vocab_size": 30522,
  "layer_norm_eps": 1e-12
}
