{
  "model_type": "qwen3",
  "architectures": ["Qwen3ForCausalLM"],
  "hidden_size": 4096,
  "num_hidden_layers": 36,
  "num_attention_heads": 32,
  "num_key_value_heads": 8,
  "intermediate_size": 12288,
  "vocab_size": 151936,
  "torch_dtype": "bfloat16"
}
